from src.ai.chunking.token import TokenChunker

chunker = TokenChunker("Qwen/Qwen3-Embedding-0.6B", 20, 10)

text = """
В утреннем свете город просыпался, окутанный свежестью и тишиной. Птицы наполняли воздух своими мелодичными трелями, а первые лучи солнца скользили по крышам домов, раскрашивая их в золотистые тона. Улицы медленно наполнялись людьми, спешащими по своим делам, но в этой суете всё равно чувствовалась особая гармония и умиротворение.
Вдали, за горизонтом, виднелись величественные горы, чьи вершины терялись в облаках. Их снежные шапки сверкали на солнце, словно бриллианты, а подножия утопали в зелёных лесах. Воздух был чистым и прозрачным, наполненным ароматами цветущих растений и свежестью горных родников. Каждый, кто смотрел на эту картину, чувствовал прилив сил и вдохновения, желание жить и наслаждаться каждым мгновением.
"""
result = chunker.split(text)
for i in range(len(result)):
    tokens_count = len(
    chunker.tokenizer.encode(
        result[i],
        add_special_tokens=False
        )
    )

    print(f'Chunk {i}, tokens = {tokens_count}: {result[i]}')