from src.ai.llm.qwen import QwenLLMProvider

llm = QwenLLMProvider()

context = """
В разделе Справочники отображается информация по отделам,
а также производится настройка поведения типов товаров.
"""

question = "Что находится в разделе Справочники?"

result = llm.generate(question, context)

print(result)




question = "Можно ли вернуть весовой товар?"

context = """
Возвраты: Разрешить возврат товара — может ли покупатель вернуть данный тип товара.
Если флажок снят, при попытке возврата появится ошибка о запрете такой операции.
Разрешить частичный возврат — может ли быть произведен частичный возврат весового товара.
"""

result = llm.generate(question, context)

print(result)